tap "homebrew/bundle"

# Git 
brew "git"
brew "git-secrets"
brew "gh"

# Rand:
brew "mas"
brew "just"
brew "lua"
brew "rustup"
brew "protobuf@3"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
cask "visual-studio-code"

# Cloud
brew "awscli"

# JS
brew "nvm"
brew "yarn"
vscode "dbaeumer.vscode-eslint"
vscode "Orta.vscode-jest"
vscode "gamunu.vscode-yarn"
vscode "esbenp.prettier-vscode"


vscode "golang.go"
vscode "maximetinu.identical-sublime-monokai-csharp-theme-colorizer"
vscode "oderwat.indent-rainbow"
vscode "tal7aouy.rainbow-bracket"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
vscode "stylelint.vscode-stylelint"
vscode "timonwong.shellcheck"
vscode "streetsidesoftware.code-spell-checker"

mas "AdBlock Pro", id: 1018301773
mas "1Blocker", id: 1365531024
mas "Slack", id: 803453959
mas "Magnet", id: 441258766
